# Getting Data

In [3]:
import pandas as pd
import numpy as np

### Step 1: Import Dataset

In [4]:
df = pd.read_csv("chipotle.tsv", sep = "\t")

In [5]:
df.head(100)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
...,...,...,...,...,...
95,42,1,Barbacoa Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",$9.25
96,42,1,Chips and Guacamole,NaN,$4.45
97,43,1,Carnitas Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",$11.75
98,43,1,Chicken Burrito,"[Tomatillo Red Chili Salsa, [Rice, Black Beans...",$8.75
99,44,1,Chicken Bowl,"[Tomatillo Red Chili Salsa, [Rice, Fajita Vege...",$8.75

### Step 2: Dataset Overview

In [37]:
df.shape

(4622, 5)

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB

In [39]:
list(df.columns) #all columns

['order_id', 'quantity', 'item_name', 'choice_description', 'item_price']

In [40]:
df.index

RangeIndex(start=0, stop=4622, step=1)

In [41]:
df.describe()

          order_id     quantity
count  4622.000000  4622.000000
mean    927.254868     1.075725
std     528.890796     0.410186
min       1.000000     1.000000
25%     477.250000     1.000000
50%     926.000000     1.000000
75%    1393.000000     1.000000
max    1834.000000    15.000000

In [42]:
df.describe(include = "all")

           order_id     quantity     item_name choice_description item_price
count   4622.000000  4622.000000          4622               3376       4622
unique          NaN          NaN            50               1043         78
top             NaN          NaN  Chicken Bowl        [Diet Coke]     $8.75
freq            NaN          NaN           726                134        730
mean     927.254868     1.075725           NaN                NaN        NaN
std      528.890796     0.410186           NaN                NaN        NaN
min        1.000000     1.000000           NaN                NaN        NaN
25%      477.250000     1.000000           NaN                NaN        NaN
50%      926.000000     1.000000           NaN                NaN        NaN
75%     1393.000000     1.000000           NaN                NaN        NaN
max     1834.000000    15.000000           NaN                NaN        NaN

### LOC AND ILOC
location
LOC: chọn dữ liệu dựa trên nhãn: nghĩa là phải truyền tên hàng hoặc cột muốn chọn. Bao gồm phần tử cuối cùng của phạm vi được truyền vào.(giả sử 2:5 thì lấy cả hàng 5)
LOC chấp nhận dữ liệu boolearn.

ILOC: Chọn dựa vào chỉ mục: nghia là phải truyền một số nguyên để chọn hàng/ cột cụ thể. 
Không bao gồm phần tử cuối cùng (2:5 thì chỉ lấy tới 4)
Không chấp nhận dữ liệu boolearn.

In [43]:
df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [44]:
df.loc[(df.quantity == 2) & (df.item_name == "Nantucket Nectar")]

,order_id,quantity,item_name,choice_description,item_price
601,247,2,Nantucket Nectar,[Pineapple Orange Banana],$6.78
2379,947,2,Nantucket Nectar,[Peach Orange],$6.78

In [45]:
df.loc[(df.quantity == 1) & (df.item_name == "Nantucket Nectar"), ['order_id', 'quantity', 'item_name', 'item_price']]

      order_id  quantity         item_name item_price
2            1         1  Nantucket Nectar     $3.39
22          11         1  Nantucket Nectar     $3.39
105         46         1  Nantucket Nectar     $3.39
173         77         1  Nantucket Nectar     $3.39
205         91         1  Nantucket Nectar     $3.39
436        189         1  Nantucket Nectar     $3.39
925        381         1  Nantucket Nectar     $3.39
1356       553         1  Nantucket Nectar     $3.39
1585       641         1  Nantucket Nectar     $3.39
1626       656         1  Nantucket Nectar     $3.39
1706       690         1  Nantucket Nectar     $3.39
2162       872         1  Nantucket Nectar     $3.39
2381       947         1  Nantucket Nectar     $3.39
2430       965         1  Nantucket Nectar     $3.39
2653      1053         1  Nantucket Nectar     $3.39
2818      1118         1  Nantucket Nectar     $3.39
2838      1128         1  Nantucket Nectar     $3.39
2853      1133         1  Nantucket Nectar     $3.39
2949      1172         1  Nantucket Nectar     $3.39
3318      1330         1  Nantucket Nectar     $3.39
3368      1351         1  Nantucket Nectar     $3.39
3570      1433         1  Nantucket Nectar     $3.39
3845      1541         1  Nantucket Nectar     $3.39
4019      1609         1  Nantucket Nectar     $3.39
4078      1632         1  Nantucket Nectar     $3.39

In [46]:
df.iloc[[100]]

     order_id  quantity            item_name choice_description item_price
100        44         1  Chips and Guacamole                NaN     $4.45

In [47]:
df.iloc[30:36]

,order_id,quantity,item_name,choice_description,item_price
30,15,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
31,16,1,Steak Burrito,"[[Roasted Chili Corn Salsa (Medium), Fresh Tom...",$8.99
32,16,1,Side of Chips,NaN,$1.69
33,17,1,Carnitas Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$8.99
34,17,1,Bottled Water,NaN,$1.09
35,18,1,Chicken Soft Tacos,"[Roasted Chili Corn Salsa, Rice]",$8.75

In [48]:
df.iloc[30:36, :-1] #Lấy tất cả cột trừ cột cuối cùng

,order_id,quantity,item_name,choice_description
30,15,1,Chips and Tomatillo-Green Chili Salsa,NaN
31,16,1,Steak Burrito,"[[Roasted Chili Corn Salsa (Medium), Fresh Tom..."
32,16,1,Side of Chips,NaN
33,17,1,Carnitas Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans..."
34,17,1,Bottled Water,NaN
35,18,1,Chicken Soft Tacos,"[Roasted Chili Corn Salsa, Rice]"

In [49]:
x = df.iloc[30:36, :-1]
y = df.iloc[30:36, -1]
print(y)

30    $2.39
31    $8.99
32    $1.69
33    $8.99
34    $1.09
35    $8.75
Name: item_price, dtype: object

#### Data Manipulation Thao tác với dữ liệu

In [50]:
df.item_price.dtype

dtype('O')

##### Apply() Func

In [51]:
df.item_price.apply(lambda x : x.replace('$', ''))

0        2.39
1        3.39
2        3.39
3        2.39
4       16.98
         ...
4617    11.75
4618    11.75
4619    11.25
4620     8.75
4621     8.75
Name: item_price, Length: 4622, dtype: object

In [52]:
#Sau khi thao tác xong, kiểu dữ liệu vẫn là object, giờ chuyển sang số thực
df.item_price.apply(lambda x : float(x.replace('$', '')) ).dtype

dtype('float64')

##### Nhưng đây chỉ áp dụng tạm thời, giờ phải gán ngược lại

In [53]:
df.item_price = df.item_price.apply(lambda x : float(x.replace('$', '')) )

In [54]:
df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98

##### Tạo một column mới hiển thị tổng giá của sp, vì quantity ở đây có một số cái là 2 nhưng giá trên này là giá từng sp.

In [55]:
df["total_price"] = df["quantity"]*df["item_price"]

In [56]:
df.head()

,order_id,quantity,item_name,choice_description,item_price,total_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39,2.39
1,1,1,Izze,[Clementine],3.39,3.39
2,1,1,Nantucket Nectar,[Apple],3.39,3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98,33.96

##### Tổng giá trị của tất cả sản phẩm đã bán được?
##### How much was the revenue for the period in the dataset?

In [57]:
revenue = df["total_price"].sum()
print(revenue)

39237.02

##### Món hàng được bán nhiều nhất?
##### Which was the most_ordered item?

#### Group By

In [1]:
#df.groupby("item_name")["quantity"].apply(print)

In [59]:
sapxep = df.groupby("item_name")["quantity"].sum()
#sapxep.sort_values tăng dần
sapxep.sort_values(ascending = False).head(10) #giảm dần #Lấy 10 gtri nhiều nhất

item_name
Chicken Bowl                    761
Chicken Burrito                 591
Chips and Guacamole             506
Steak Burrito                   386
Canned Soft Drink               351
Chips                           230
Steak Bowl                      221
Bottled Water                   211
Chips and Fresh Tomato Salsa    130
Canned Soda                     126
Name: quantity, dtype: int64

##### Tìm những sp khác nhau và đếm sl

In [60]:
#values_count
#df.item_name.value_counts() #Hiển thị các sp khác nhau và sl bán của nó
# Đếm xem có bao nhiêu loại sản phẩm
df.item_name.value_counts().count()

50

##### Còn một hàm khác chuyên tính giá trị khác nhau NUNIQUE

In [33]:
df.item_name.nunique()

50